<template>
  <div class="sudoku-config-controls">
    <h2>
      Управление:
    </h2>
    <p>
      Ячейки способны окрашиваться в 3 цвета: красный, желтый и зеленый:
    </p>
    <ul>
      <li>
        Красный указывает на наличие ошибки в ряде / колонке / квадрате 3х3
      </li>
      <li>
        Зеленый указывает на правильную полную заполненность в ряде / колонке / квадрате 3х3
      </li>
      <li>
        Желтый является комбинацией предыдущих 2 случаев
      </li>
    </ul>
    <p>
      Можно играть как с помощью мышки, так и с помощью клавиатуры:
    </p>
    <ul>
      <li>
        tab - переключение к следующей ячейке
      </li>
      <li>
        клавиша вверх / клавиша вниз позволяют менять значение текущей ячейки
      </li>
    </ul>
  </div>
</template>

<style lang="scss" scoped>
.sudoku-config-controls {
  width: 600px;
  max-width: 100%;
  margin: 2em auto 0;
  text-align: left;
}
</style>
