<template>
  <div class="sudoku-config-rules">
    <h2>
      Правила:
    </h2>
    <p>
      Игровое поле представляет собой квадрат размером 9×9, разделённый на меньшие квадраты со стороной в 3 клетки. Таким образом, всё игровое поле состоит из 81 клетки. В них уже в начале игры стоят некоторые числа (от 1 до 9), называемые подсказками. От игрока требуется заполнить свободные клетки цифрами от 1 до 9 так, чтобы в каждой строке, в каждом столбце и в каждом малом квадрате 3×3 каждая цифра встречалась бы только один раз.
    </p>
  </div>
</template>

<style lang="scss" scoped>
.sudoku-config-rules {
  width: 600px;
  max-width: 100%;
  margin: 2em auto 0;
  text-align: left;
}
</style>
